[
    {
        "id": 1,
        "title": "Roy Lunetier",
        "subtitle": "Gestion de projet\nDéveloppement frontend",
        "image": "/images/roy_lunetier_image1.png",
        "image2": "/images/roy_lunetier_image2.png",
        "image3": "/images/roy_lunetier_image3.png",
        "description1": "Dans le cadre de la SAE 501, j'ai mené le développement d'une application innovante qui permet la visualisation en 3D de montures de lunettes sous tous les angles et leur essayage en réalité augmentée. En tant que cheffe de projet, j'ai supervisé l'ensemble du processus de création, en assurant la gestion de projet depuis la phase de conception jusqu'au déploiement final. Mon rôle a consisté à coordonner les équipes, à établir des plannings et à veiller à ce que chaque étape du projet soit menée à bien dans les délais impartis.",
        "description2": "En parallèle de mes responsabilités de gestion de projet, j'ai également développé le site de présentation de l'application, qui a été conçu pour mettre en valeur les fonctionnalités de notre visualisateur 3D et de l'essayage en réalité augmentée. Ce site permet aux utilisateurs de découvrir les atouts de notre application de manière claire et engageante. De plus, j'ai pris en charge la création et la gestion de la campagne kickstarter associée au projet, en élaborant une stratégie de communication efficace pour attirer les contributeurs et maximiser le financement.\nGrâce à ce projet, j'ai pu mettre en pratique mes compétences en gestion de projet. Le résultat final est une solution complète qui allie technologie de pointe et expérience utilisateur, et qui a été soutenue par une campagne kickstarter réussie.",
        "slug": "roy_lunetier",
        "link1": "https://sae501.julie-vh.fr/presentation",
        "label1": "Lien vers le site de présentation du projet",
        "link2": "https://sae501.julie-vh.fr/kickstarter",
        "label2": "Lien vers le kickstarter du projet",
        "link3": "https://github.com/JulieVanHoudenhove/sae501",
        "label3": "Lien vers le repository du projet",
        "skills": [1, 6, 8, 10, 16, 20, 24]
    },
    {
        "id": 2,
        "title": "Pokedex",
        "subtitle": "Développement mobile",
        "image": "/images/pokedex_image1.png",
        "image2": "/images/pokedex_image2.png",
        "image3": "/images/pokedex_image3.png",
        "description1": "Dans le cadre de ce projet, j'ai développé une application mobile en React Native, un framework que j'ai découvert et appris à maîtriser à cette occasion. Mon application, un Pokédex, permettait aux utilisateurs de visualiser une liste de Pokémon, d'accéder aux détails spécifiques de chaque créature, et d'ajouter des Pokémon à leur équipe. En utilisant Expo Go, j'ai pu tester et visualiser l'application en temps réel, ce qui a grandement facilité le processus de développement et d'itération. Cette expérience m'a permis de renforcer mes compétences en développement mobile tout en explorant les fonctionnalités offertes par React Native.",
        "description2": "L'application intégrait également plusieurs fonctionnalités interactives pour améliorer l'expérience utilisateur. Par exemple, j'ai implémenté une fonction de recherche pour permettre aux utilisateurs de trouver rapidement un Pokémon spécifique. De plus, l'application offrait la possibilité de personnaliser son profil en utilisant l'appareil photo pour changer la photo de profil. Tout le code source de ce projet a été soigneusement versionné et stocké sur GitHub, garantissant ainsi un suivi rigoureux du développement et facilitant la collaboration éventuelle avec d'autres développeurs.",
        "slug": "pokedex",
        "link1": "https://github.com/JulieVanHoudenhove/pokedex-app",
        "label1": "Lien vers le repository du projet",
        "skills": [20, 18, 11, 6]
    },
    {
        "id": 3,
        "title": "Portfolio",
        "subtitle": "Développement fullstack",
        "image": "https://via.placeholder.com/150",
        "image2": "https://via.placeholder.com/250",
        "image3": "https://via.placeholder.com/350",
        "description1": "Actuellement, je travaille sur le développement de mon portfolio personnel en utilisant Next.js, une technologie que j'ai eu l'occasion de découvrir et d'apprendre au cours de ce projet. Avant de plonger dans le développement, j'ai conçu le visuel du site sur Figma, ce qui m'a permis de planifier une interface utilisateur esthétique et intuitive. Pour le développement, j'ai choisi Tailwind CSS, un framework qui facilite la création de designs modernes et réactifs. Ce projet m'a permis non seulement d'explorer Next.js, mais aussi de perfectionner mes compétences en design et en intégration avec Tailwind.",
        "description2": "À l'avenir, j'envisage d'ajouter un backoffice à ce portfolio pour gérer facilement les projets et les compétences affichés. Ce backoffice pourrait être développé en Symfony ou dans une autre technologie adaptée, selon les besoins du projet. Mon objectif est de créer un portfolio dynamique et évolutif qui reflète non seulement mes compétences techniques, mais aussi ma capacité à gérer et à développer des projets complexes de bout en bout.",
        "slug": "porfolio",
        "link1": "https://github.com/JulieVanHoudenhove/portfolio",
        "label1": "Lien vers le repository du projet",
        "skills": [5, 6, 12, 18, 20, 23, 24]
    },
    {
        "id": 4,
        "title": "To Do List",
        "subtitle": "Développement fullstack",
        "image": "/images/todo_list_image1.png",
        "image2": "/images/todo_list_image2.png",
        "image3": "/images/todo_list_image3.png",
        "description1": "J'ai développé une application ToDo List en Vue.js afin de continuer à approfondir mes compétences avec cette technologie. J'ai commencé par concevoir une maquette visuelle de l'application, en prenant en compte les contraintes d'ergonomie et de design que je m'étais fixées. Deux versions de cette application ont été réalisées. La première, développée en Symfony et Vue.js, utilise la commande make\npour générer la gestion du backend. J'ai ensuite personnalisé ce code pour permettre une gestion complète des tâches sur une seule page, optimisant ainsi l'expérience utilisateur.",
        "description2": "La seconde version de l'application a été réalisée en HTML, CSS, et Alpine.js, un framework léger qui partage des similitudes syntaxiques avec Vue.js. Pour les deux versions, j'ai intégré Tailwind CSS, ce qui m'a permis de continuer à approfondir mes compétences en design réactif et moderne. Cette ToDo List est entièrement responsive et inclut un mode sombre et clair, offrant ainsi une expérience utilisateur personnalisable. Ces projets m'ont permis de renforcer mes compétences en développement frontend tout en explorant différentes approches pour réaliser une application fonctionnelle et esthétiquement agréable.",
        "slug": "to_do_list",
        "link1": "https://github.com/JulieVanHoudenhove/ToDo",
        "label1": "Lien vers le repository du projet",
        "skills": [22, 24, 21, 20, 18, 14, 9, 8, 6, 5 ]
    },
    {
        "id": 5,
        "title": "Cyberfiction",
        "subtitle": "Intégration frontend",
        "image": "/images/cyberfiction_image1.png",
        "image2": "/images/cyberfiction_image2.png",
        "image3": "/images/cyberfiction_image3.png",
        "description1": "Inspirée par les animations fluides et dynamiques du site Apple, j'ai entrepris de comprendre et de reproduire ces effets de scroll dans un projet personnel. Après m'être documentée sur les techniques utilisées pour maîtriser ces animations tout en créant un visuel original. Le site que j'ai développé est construit en HTML, CSS, et JavaScript, avec une utilisation particulière de GSAP (GreenSock Animation Platform) pour les animations. Ce projet m'a permis d'explorer en profondeur les possibilités offertes par les animations au scroll et d'améliorer mes compétences en création d'interfaces web interactives.",
        "description2": "Le résultat est un site web qui intègre des animations élégantes et engageantes, déclenchées par le défilement de la page. Ces animations ajoutent une dimension dynamique au contenu, captant l'attention de l'utilisateur et améliorant l'expérience de navigation. En travaillant sur ce projet, j'ai non seulement approfondi mes connaissances en GSAP et en animation web, mais j'ai aussi renforcé ma capacité à combiner design et développement pour créer des interfaces attrayantes et modernes. ",
        "slug": "cyberfiction",
        "link1": "/cyberfiction/index.html",
        "label1": "Lien vers le projet",
        "link2": "https://github.com/JulieVanHoudenhove/cyberfiction",
        "label2": "Lien vers le repository du projet",
        "skills": [1, 2, 3, 7, 20]
    },
    {
        "id": 6,
        "title": "Studio Ghibli",
        "subtitle": "Intégration frontend",
        "image": "/images/studio_ghibli_image1.png",
        "image2": "/images/studio_ghibli_image2.png",
        "image3": "/images/studio_ghibli_image3.png",
        "description1": "Après avoir exploré les animations au scroll vertical, je me suis intéressée aux effets de scroll horizontal, qui offrent une manière différente et engageante de présenter du contenu. Pour maîtriser cette technique et apprendre les principes et les méthodes pour implémenter un scroll horizontal fluide. Le site que j'ai développé est réalisé en HTML, CSS, et JavaScript, avec l'utilisation de GSAP (GreenSock Animation Platform) pour gérer les animations. Ce projet m'a permis d'enrichir mes compétences en matière de scroll animations et de mieux comprendre comment manipuler le défilement pour créer des interfaces utilisateur innovantes.",
        "description2": "Le résultat final est un site où le contenu défile horizontalement, créant une expérience de navigation immersive et moderne. En combinant HTML, CSS, JS, et GSAP, j'ai pu créer une interface qui se distingue par sa fluidité et son interactivité. Ce projet a renforcé ma capacité à utiliser des techniques d'animation avancées pour concevoir des sites web dynamiques et esthétiques.",
        "slug": "studio_ghibli",
        "link1": "/studio_ghibli/index.html",
        "label1": "Lien vers le projet",
        "link2": "https://github.com/JulieVanHoudenhove/studio_ghibli",
        "label2": "Lien vers le repository du projet",
        "skills": [1, 2, 3, 7, 20]
    },
    {
        "id": 7,
        "title": "Elecar",
        "subtitle": "Intégration frontend",
        "image": "/images/elecar_image1.png",
        "image2": "/images/elecar_image2.png",
        "image3": "/images/elecar_image3.png",
        "description1": "Dans le cadre de ce projet, j'ai suivi un tutoriel pour développer une page web dédiée à l'univers automobile. Ce projet m'a offert une excellente opportunité pour perfectionner mes compétences en responsive design, en veillant à ce que la page s'adapte harmonieusement à différents formats d'écran. En plus de l'aspect responsive, j'ai appris à implémenter des animations d'apparition d'éléments lors du scroll, ce qui ajoute une dimension interactive et dynamique à l'expérience utilisateur.",
        "description2": "Un autre aspect clé de ce projet a été l'intégration de la fonctionnalité de tri des éléments via des data attributes en JavaScript. Cette technique m'a permis de créer une interface plus interactive et personnalisée, où les utilisateurs peuvent facilement filtrer et trouver les informations qui les intéressent. Le site a été réalisé en HTML, CSS, et JavaScript, combinant ces technologies pour aboutir à un design soigné et fonctionnel.",
        "slug": "elecar",
        "link1": "/elecar/index.html",
        "label1": "Lien vers le projet",
        "skills": [1, 2, 3]
    },
    {
        "id": 8,
        "title": "Sushis",
        "subtitle": "Intégration frontend",
        "image": "/images/sushis_image1.png",
        "image2": "/images/sushis_image2.png",
        "image3": "/images/sushis_image3.png",
        "description1": "Pour le projet Sushis, j'ai suivi un tutoriel visant à approfondir mes connaissances sur la mise en place de thèmes sombres et clairs (dark and light mode). J'ai découvert que cette fonctionnalité peut être efficacement gérée à l'aide de variables de couleurs en CSS, ce qui permet une gestion centralisée et facile des thèmes. En parallèle, ce projet m'a également permis de renforcer mes compétences en animation des éléments lors du scroll et de perfectionner le responsive design pour offrir une expérience utilisateur optimale sur divers appareils.",
        "description2": "Le site a été développé en HTML, CSS, et JavaScript, combinant ces technologies pour créer une interface attrayante et fonctionnelle. L'intégration des animations et des ajustements de responsive design a contribué à rendre le site non seulement visuellement captivant mais également fluide et interactif.",
        "slug": "sushis",
        "link1": "/sushis/index.html",
        "label1": "Lien vers le projet",
        "skills": [1, 2, 3]
    },
    {
        "id": 9,
        "title": "NSerie",
        "subtitle": "Développement fullstack",
        "image": "/images/nserie_image1.png",
        "image2": "/images/nserie_image2.png",
        "image3": "/images/nserie_image3.png",
        "description1": "Pour le projet SAÉ 203, j'ai développé un site web interactif exploitant une base de données, avec une attention particulière portée sur la gestion des données et des fonctionnalités interactives. Le site inclut une interface d'administration permettant de modifier, ajouter ou supprimer des informations de manière intuitive et sécurisée. Le développement a été réalisé en PHP pour le backend, SQL pour la gestion de la base de données, et HTML/CSS pour la conception de l'interface utilisateur.",
        "description2": "Le site a été déployé sur deux hébergements différents afin d'assurer une haute disponibilité et de tester la robustesse de l'application dans divers environnements. Ce projet m'a permis de mettre en pratique mes compétences en développement web full-stack et d'approfondir mes connaissances en gestion de base de données et déploiement.",
        "slug": "nserie",
        "link1": "https://mmi21f15.sae203.ovh/index.php",
        "label1": "Lien vers le projet",
        "link2": "https://github.com/JulieVanHoudenhove/sae203",
        "label2": "Lien vers le repository du projet",
        "skills": [1, 2, 4, 20]
    }
]
